app/views/pedidos/_itempedido_fields.html.erb

SELECT "produtos".* FROM "produtos" WHERE "produtos"."deleted_at" IS NULL
---
      <%= f.label :produto_id, style: "display: block" %>
      <%= f.select :produto_id,
            options_for_select(Produto.all.map { |r| [ r.name,  r.id] },
             f.object.produto_id), {}, class: 'form-control form-select' %>