app/views/pedidos/_pedido.html.erb

    <tbody>
      <% pedido.itempedidos.each do |itempedido| %>
---
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."deleted_at" IS NULL
SELECT "itempedidos".* FROM "itempedidos" WHERE "itempedidos"."deleted_at" IS NULL AND "itempedidos"."pedido_id" = $1  [["pedido_id", 3]]