app/controllers/itempedidos_controller.rb

SELECT "itempedidos".* FROM "itempedidos" WHERE "itempedidos"."deleted_at" IS NULL
---
  def index
    @itempedidos = Itempedido.all

INSERT INTO "itempedidos" ("valor", "deleted_at", "produto_id", "pedido_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["valor", nil], ["deleted_at", nil], ["produto_id", 1], ["pedido_id", 1], ["created_at", "2024-06-28 00:53:21.484065"], ["updated_at", "2024-06-28 00:53:21.484065"]]
---
  def create
    @itempedido = Itempedido.new(itempedido_params)

    respond_to do |format|
      if @itempedido.save

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."deleted_at" IS NULL AND "pedidos"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "itempedidos".* FROM "itempedidos" WHERE "itempedidos"."deleted_at" IS NULL AND "itempedidos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_itempedido
      @itempedido = Itempedido.find(params[:id])