app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."deleted_at" IS NULL
---
  def index
    @pedidos = Pedido.all

INSERT INTO "pedidos" ("name", "date", "date_validade", "status", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", nil], ["date", nil], ["date_validade", nil], ["status", nil], ["deleted_at", nil], ["created_at", "2024-06-28 00:05:49.836759"], ["updated_at", "2024-06-28 00:05:49.836759"]]
---
  def create
    @pedido = Pedido.new(pedido_params)

    respond_to do |format|
      if @pedido.save

UPDATE "pedidos" SET "name" = $1, "date" = $2, "date_validade" = $3, "updated_at" = $4 WHERE "pedidos"."id" = $5  [["name", "Carmo da silva"], ["date", "2024-06-20"], ["date_validade", "2024-07-05"], ["updated_at", "2024-06-28 13:12:49.064690"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @pedido.update(pedido_params)

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."deleted_at" IS NULL AND "pedidos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_pedido
      @pedido = Pedido.find(params[:id])