app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."deleted_at" IS NULL

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("name", "valor", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Sabao"], ["valor", "2.33"], ["deleted_at", nil], ["created_at", "2024-06-28 00:11:35.228605"], ["updated_at", "2024-06-28 00:11:35.228605"]]

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "name" = $1, "updated_at" = $2 WHERE "produtos"."id" = $3  [["name", "Pão francês"], ["updated_at", "2024-06-28 21:01:09.495836"], ["id", 5]]

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."deleted_at" IS NULL AND "produtos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]